Cinema/src/DataProcessors/ОбновлениеДопИнформации/ОбновлениеДопИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбновлениеДопИнформации</name>
</mdclass:DataProcessor>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/DataProcessors/ОбновлениеДопИнформации/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗагружаемыйПериод = НачалоМесяца(ТекущаяДатаСеанса());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)

	Если ПроверитьЗаполнение() Тогда
		ОбновлениеДопИнформацию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновлениеДопИнформацию()
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ВременныйФайл = ПолучитьИмяВременногоФайла("html");
	ПутьКСтранице = ПолучитьПутьКСтранице(ЗагружаемыйПериод);
	
	Попытка
		Соединение	= Новый HTTPСоединение("kino.mail.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		Соединение.Получить(ПутьКСтранице, ВременныйФайл);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подключения к сайту; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ТекущийФайл  = Новый Файл(ВременныйФайл);
	ДокТекст     = Новый ТекстовыйДокумент;
	ДопПараметры = Новый Структура("ИмяФайла, ДокТекст", ТекущийФайл.Имя, ДокТекст);
	Описание     = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиЧтенияФайла", ЭтотОбъект);
	ДокТекст.НачатьЧтение(Описание, ТекущийФайл.ПолноеИмя, КодировкаТекста.UTF8);

	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиЧтенияФайла(ИнфоОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Причина = ?(ИнфоОбОшибке.Причина <> Неопределено, ИнфоОбОшибке.Причина.Описание, ИнфоОбОшибке.Описание);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка открытия файла <%1>; по причине: <%2>.'"), ДополнительныеПараметры.ИмяФайла, Причина);;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ДополнительныеПараметры) Экспорт
	
	ДокТекст      = ДополнительныеПараметры.ДокТекст;
	СтраницаHTML  = ДокТекст.ПолучитьТекст();
	
	ОбновитьКомментарииНаСервере(СтраницаHTML);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомментарииНаСервере(СтраницаHTML)
	
	НачалоВхождения    = "\{\""id\"":([0-9\-\/]+)\,\""main_rubric_id\""\:1,\""name\""\:"""; // {"id":959616,"main_rubric_id":1,"name":"
	ОкончаниеВхождения = "\""release_date"":""\d{4}-\d{2}-\d{2}\""\}"; // "release_date":"2026-07-02"}
	
	РегулярноеВыражение = НачалоВхождения + ".*" + ОкончаниеВхождения;

	РезультатПоиска = СтрНайтиПоРегулярномуВыражению(СтраницаHTML, РегулярноеВыражение, НаправлениеПоиска.СНачала, , , , Истина);
	Если РезультатПоиска.Длина = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МнчСтрока = РезультатПоиска.Значение;
	РегулярноеВыражение = ОкончаниеВхождения + "\," + НачалоВхождения;
	
	Пока Истина Цикл
		РезультатПоиска = СтрНайтиПоРегулярномуВыражению(МнчСтрока, РегулярноеВыражение, НаправлениеПоиска.СНачала, , , , Истина);
		Если РезультатПоиска.Длина = 0 Тогда
			Прервать;
		КонецЕсли;
		МнчСтрока = СтрЗаменить(МнчСтрока, РезультатПоиска.Значение, СтрЗаменить(РезультатПоиска.Значение, "},{", "}" + Символы.ПС + "{"));
	КонецЦикла;
	
	КолСтрок = СтрЧислоСтрок(МнчСтрока);
	МассивДанных = Новый Массив;
	
	Для ИндексСтроки = 1 По КолСтрок Цикл
		СтрокаJSON = СтрПолучитьСтроку(МнчСтрока, ИндексСтроки);
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаJSON);
		Попытка
			Данные = ПрочитатьJSON(Чтение);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка распознования файла HTML по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
		Чтение.Закрыть();
		МассивДанных.Добавить(Новый Структура("Наименование, IMDb, Время", ВРег(Данные.name), Формат(Данные.imdb_rating, "ЧЦ=2; ЧДЦ=1; ЧРД=.; ЧН="), Данные.duration));
	КонецЦикла;
	
	СтрДлинаФильма  = НСтр("ru = 'Продолжительность'");
	СтрокаIMDb      = НСтр("ru = 'IMDb'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.Комментарий КАК Комментарий,
		|	Фильмы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.ДатаВыхода МЕЖДУ НАЧАЛОПЕРИОДА(&ЗагружаемыйПериод, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ЗагружаемыйПериод, МЕСЯЦ)
		|	И НЕ Фильмы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильмы.ДатаВыхода,
		|	Наименование";
	
	Запрос.УстановитьПараметр("ЗагружаемыйПериод", ЗагружаемыйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеСтроки = Новый Массив;
	ТаблицаФильмов    = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаТаблицы Из ТаблицаФильмов Цикл
	    СтрокаТаблицы.Наименование = СокрЛП(ВРег(СтрокаТаблицы.Наименование));
		Если СтрНайти(СтрокаТаблицы.Наименование, "Ё") > 0 Тогда
			ДобавляемыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ДобавляемаяСтрока Из ДобавляемыеСтроки Цикл
		НоваяСтрока = ТаблицаФильмов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавляемаяСтрока);
		НоваяСтрока.Наименование = СтрЗаменить(НоваяСтрока.Наименование, "Ё", "Е");
	КонецЦикла;
	
	Для каждого ЭлементМассива Из МассивДанных Цикл
		
		ИскомаяСтрока = ТаблицаФильмов.Найти(СокрЛП(ЭлементМассива.Наименование), "Наименование");
		
		Если ИскомаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Комментарий = СокрЛП(ИскомаяСтрока.Комментарий);
		Если СтрНайти(Комментарий, СтрокаIMDb) = 0 И ЗначениеЗаполнено(ЭлементМассива.IMDb) Тогда
			Комментарий = Комментарий + ?(ПустаяСтрока(Комментарий), "", "; ") + СтрШаблон("%1 %2", СтрокаIMDb, ЭлементМассива.IMDb);
		Иначе
			Если ЗначениеЗаполнено(ЭлементМассива.IMDb) Тогда
				ЗаменитьВКомментарии(Комментарий, СтрокаIMDb, ЭлементМассива.IMDb);
			КонецЕсли;
		КонецЕсли;
		Если СтрНайти(Комментарий, СтрДлинаФильма) = 0 И ЗначениеЗаполнено(ЭлементМассива.Время) Тогда
			Комментарий = Комментарий + ?(ПустаяСтрока(Комментарий), "", "; ") + СтрШаблон(НСтр("ru = '%1: %2'"), СтрДлинаФильма, ЭлементМассива.Время);
		КонецЕсли;
		
		Если ИскомаяСтрока.Комментарий <> Комментарий Тогда
			СпрОбъект = ИскомаяСтрока.Ссылка.ПолучитьОбъект();
			СпрОбъект.Комментарий = Комментарий;
			Попытка
			    СпрОбъект.Записать();
			Исключение
				Описание_Ошибки = ОписаниеОшибки();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка записи <%1>; по причине: %2.'"), ИскомаяСтрока.Ссылка, Описание_Ошибки);
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;

	КонецЦикла;
	
	ФоновыеЗадания.Выполнить("ОбщийМодульСервер.ОбновитьИсториюДанных", , Новый УникальныйИдентификатор, НСтр("ru = 'Обновление истории данных'"));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаменитьВКомментарии(ОбрабатываемаяСтрока, СтрокаВхождение, СтрокаЗамены)

	Вхождение = СтрНайти(ОбрабатываемаяСтрока, СтрокаВхождение);
	Если Вхождение > 0 Тогда
		
		ДлинаВхождения = СтрДлина(СтрокаВхождение);
		ОкончаниеБлока = СтрНайти(ОбрабатываемаяСтрока, ";", НаправлениеПоиска.СНачала, Вхождение+ДлинаВхождения);
		
		ЛеваяЧасть = Лев(ОбрабатываемаяСтрока, Вхождение+ДлинаВхождения);
		Если ОкончаниеБлока > 0 Тогда
			ПраваяЧасть = Сред(ОбрабатываемаяСтрока, ОкончаниеБлока);
		Иначе
			ПраваяЧасть = "";
		КонецЕсли;
		
		ОбрабатываемаяСтрока = ЛеваяЧасть + СтрокаЗамены + ПраваяЧасть;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПутьКСтранице(мЗагружаемыйПериод)

	Возврат "cinema/soon/" + Формат(мЗагружаемыйПериод, "ДФ=yyyy") + "/" + Формат(мЗагружаемыйПериод, "ДФ=MM") + "/";

КонецФункции

#КонецОбласти
